### **2일차 네줄리뷰(Four Lines Review)** ###
- 사실(Facts): 기본 자료형, IDE 사용법
- 발견(Discovery): 이름규칙, 인터프리터 및 IDE의 기초적인 개념, 변수(변수명명법), Str, 컨테이너 자료형, 사칙연산, 앝은복사 및 깊은복사 등등의 기초적인 내용
- 배운점(Lesson Learned): 알고있는 내용이 대다수이지만 기본 개념의 중요성 다시 각인하고 공부함으로써 오류 발생시 해결할 수 있는 기본개념을 향상시켰다. 
- 선언(Daclaration): 코딩할때 자주 사용되는 개념이 존재하는 방면 아닌 개념도 존재하지만 오류 발생시 어떠한 이유에서 오류가 발생하였는지 파악하는 것이 중요하다 이를 위해 기본개념을 지속적으로 암기하고 체득해야한다.


### 까먹었다가 배운 개념  ###
- 부동소수점의 오차 발생 2의 N제곱으로 정확히 나뉘어지지 않을떄 약간의 오차가 발생한다. 이를 해결하기 위해서 고정 소수점(decimal)사용
- set(집합형) : 딕셔너리에서 KEY(키)만으로 관리하는 Hash 자료구조
- dir(a) --> a의 타입에 따라서 튜플, 딕셔너리 등 에서 사용가능한 함수들을 출력해준다.
- 얕은 복사와 깊은 복사 : 앝은 복사는 주소복사, 값복사라고도 하는데 복사본과 원본은 같은 주소를 갖게 되고 원본의 변형이 생기면 복사본 또한 변형이 일어난다.
- 깊은 복사에서는 원본이 변형이 될지라도 복사본과 원본의 주소가 다르기에 복사본의 변형은 일어나지 않는다.
- 앝은 복사 와 깊은 복사 예시 ) 
import copy as 
co arr2Dcopy3 = co.deepcopy(arr2D) #deepcopy를 해서 이제 복사본의 주소값이다르다.
id(arr2Dcopy), id(arr2Dcopy3)
-- >(2224168245120, 2224168409088)




### 몰랐던 개념 ###
- """ """ : 문자열(String)에서 멀티라인의 개념
- 문자열 이스케이프, 충돌을 방지하기 위해서 역슬래시(\)를 사용해서 그 뒤에 문자 혹은 문자가 의미하는 약어와의 충돌을 피하는 것
- 문자열 이스케이프 예시) print('this\'s a dog')
